Repository: GauravMcode/Ram_Mandir_App
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: Ram Mandir App
hi: राम मंदिर ऐप

source: Language
hi: भाषा

source: English
hi: अंग्रेज़ी

source: Hindi
hi: हिंदी

# title1
source: Temple Destruction
hi: मंदिर विध्वंस

# desc1
source: The Ancient Temple of Lord Rama was demolished by a mughal commander and a mosque was erected over the same place, known as Babri Masjid
hi: भगवान राम के प्राचीन मंदिर को एक मुगल कमांडर ने ध्वस्त कर दिया था और उसी स्थान पर एक मस्जिद बनाई गई थी, जिसे बाबरी मस्जिद के नाम से जाना जाता है।

# title2
source: Communal Riots
hi: सांप्रदायिक दंगे

# desc2
source: Communal riots occurred around the site where the mosque was constructed. Subsequently, in 1859, the British administration erected a fence around the disputed area, allowing Muslims to worship inside the mosque and granting Hindus permission to worship near the courtyard.
hi: जिस स्थान पर मस्जिद का निर्माण किया गया था, उसके आसपास सांप्रदायिक दंगे हुए। इसके बाद, 1859 में, ब्रिटिश प्रशासन ने विवादित क्षेत्र के चारों ओर एक बाड़ लगा दी, जिससे मुसलमानों को मस्जिद के अंदर पूजा करने की अनुमति मिल गई और हिंदुओं को प्रांगण के पास पूजा करने की अनुमति मिल गई।

# title3
source: Idols Manifest
hi: मूर्तियाँ प्रकट

# desc3
source: on September 23, 1949, when idols of Lord Rama were found inside the mosque. Hindus claimed that Lord Rama had manifested himself there. The Uttar Pradesh government ordered the immediate removal of the idols
hi: 23 सितंबर 1949 को, जब मस्जिद के अंदर भगवान राम की मूर्तियाँ पाई गईं। हिंदुओं का दावा था कि भगवान राम वहां स्वयं प्रकट हुए थे। उत्तर प्रदेश सरकार ने मूर्तियों को तत्काल हटाने का आदेश दिया

# title4
source: Petition in court
hi: कोर्ट में याचिका

# desc4
source: Two petitions were filed in the Faizabad Civil Courtâ€”one seeking permission for the worship of Lord Rama on the disputed land and the other seeking permission to install idols.
hi: फ़ैज़ाबाद सिविल कोर्ट में दो याचिकाएँ दायर की गईं - एक विवादित भूमि पर भगवान राम की पूजा की अनुमति देने की मांग कर रही थी और दूसरी मूर्तियां स्थापित करने की अनुमति मांग रही थी।

# title5
source: Permission to Worship
hi: पूजा करने की अनुमति

# desc5
source: On February 1, 1986, based on a petition by Umesh Chandra Pandey, a Faizabad district judge, K.M. Pandey granted permission for Hindus to worship and ordered the removal of the locks from the structure.
hi: 1 फरवरी 1986 को फैजाबाद जिला न्यायाधीश उमेश चंद्र पांडे की याचिका के आधार पर के.एम. पांडे ने हिंदुओं को पूजा करने की अनुमति दी और ढांचे से ताले हटाने का आदेश दिया।

# title6
source: Babri Demolition
hi: बाबरी विध्वंस

# desc6
source: 1992: A historic event occurred on December 6, 1992, when thousands of activists, including those from the Vishwa Hindu Parishad (VHP) and Shiv Sena, demolished the disputed structure. This led to nationwide communal riots and the loss of thousands of lives.
hi: 1992: 6 दिसंबर 1992 को एक ऐतिहासिक घटना घटी, जब विश्व हिंदू परिषद (वीएचपी) और शिव सेना के कार्यकर्ताओं सहित हजारों कार्यकर्ताओं ने विवादित ढांचे को ध्वस्त कर दिया। इसके कारण देशव्यापी सांप्रदायिक दंगे हुए और हजारों लोगों की जान चली गई।

# title7
source: Allahabad HC verdict
hi: इलाहाबाद HC का फैसला

# desc7
source: The Allahabad High Court divided the disputed land into three equal parts among the Sunni Waqf Board, Ram Lalla Virajman, and the Nirmohi Akhara.
hi: इलाहाबाद हाई कोर्ट ने विवादित जमीन को सुन्नी वक्फ बोर्ड, राम लला विराजमान और निर्मोही अखाड़ा के बीच तीन बराबर हिस्सों में बांट दिया.

# title8
source: Supreme Court verdict
hi: सुप्रीम कोर्ट का फैसला

# desc8
source: On November 9: A bench of five judges of the Supreme Court delivered a verdict in favor of the Ram Janmabhoomi, awarding 2.77 acres of the disputed land to the Hindu side and allocating an additional 5 acres separately for a mosque.
hi: 9 नवंबर को: सुप्रीम कोर्ट की पांच जजों की पीठ ने राम जन्मभूमि के पक्ष में फैसला सुनाया, जिसमें 2.77 एकड़ विवादित भूमि हिंदू पक्ष को दी गई और मस्जिद के लिए अलग से 5 एकड़ जमीन आवंटित की गई।

# title9
source: Ram Mandir
hi: राम मंदिर

# desc9
source: On January 22, 2024, the consecration of the grand temple of Ram Lalla took place, bringing an end to the dispute that has spanned decades, and the worship of Ram Lalla was carried out in a ceremonious manner.
hi: 22 जनवरी, 2024 को रामलला के भव्य मंदिर की प्रतिष्ठा हुई, जिससे दशकों से चले आ रहे विवाद का अंत हुआ और समारोहपूर्वक रामलला की पूजा-अर्चना की गई।

# mTitle1
source: Mere Ghar Ram Aaye Hain
hi: मेरे घर राम आये हैं

# mSinger1
source: Jubin Nautiyal
hi: जुबिन नौटियाल

# mTitle2
source: Yug Ramrajya ka Aa Gaya
hi: युग रामराज्य का आ गया

# mSinger2
source: Hansraj Raghuwanshi
hi: हंसराज रघुवंशी
